Config/InformationRegisters/НастройкиПраваПодписиДокументовЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПраваПодписиДокументовЦБ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОпределенияПодписанта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияПодписантаВЦБ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбслуживаемоеУчреждение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтветственногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СпособыОпределенияПодписантаВЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияПодписантаВЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеЛицоЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеЛицоУчреждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СотрудникУчреждения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/НастройкиПраваПодписиДокументовЦБ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦентрализованнаяБухгалтерия = Константы.ОрганизацияЦентрализованнаяБухгалтерия.Получить();
	
	УправлениеЭлементамиФормы(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи); 
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособОпределенияПодписантаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбслуживаемоеУчреждениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	
	КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	НастройкаКомпоновщика = КомпоновщикНастроекКомпоновкиДанных.Настройки;
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(НастройкаКомпоновщика.Отбор,
		"Ссылка",ВидСравненияКомпоновкиДанных.НеРавно,ЦентрализованнаяБухгалтерия,,Истина);
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкаКомпоновщика);
		
	ОткрытьФорму("Справочник.Организации.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы(Инициализация = Ложь)
	
	Если Запись.СпособОпределенияПодписанта = ПредопределенноеЗначение("Перечисление.СпособыОпределенияПодписантаВЦБ.СотрудникЦБ")
		ИЛИ Запись.СпособОпределенияПодписанта = ПредопределенноеЗначение("Перечисление.СпособыОпределенияПодписантаВЦБ.СотрудникУчреждения") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы,
		"Сотрудник", "Видимость", Истина);
		
		Если Запись.СпособОпределенияПодписанта = ПредопределенноеЗначение("Перечисление.СпособыОпределенияПодписантаВЦБ.СотрудникЦБ") Тогда
			НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "ЦентрализованнаяБухгалтерия");
		Иначе
			НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Запись.ОбслуживаемоеУчреждение");
		КонецЕсли;
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Если НЕ ОбщегоНазначения.ДанныеСовпадают(ЭтаФорма.Элементы.Сотрудник.СвязиПараметровВыбора,НовыеСвязи) Тогда
			ЭтаФорма.Элементы.Сотрудник.СвязиПараметровВыбора = НовыеСвязи;
			Если Не Инициализация Тогда
				Запись.Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы,
		"Сотрудник", "Видимость", Ложь);
		
		Если Не Инициализация Тогда
			Запись.Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
